hills_re2800/0.orig/omega
FoamFile { version 2.0; format ascii; class volScalarField; object omega; }

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1000;

boundaryField
{
    "(inlet|outlet|front|back)"
    {
        type            cyclic;
    }

    "(top|hills)"
    {
        type            omegaWallFunction;
        value           uniform 1000;
    }
}
